Revit 2026 API

# DecimalSymbol Enumeration

---

The symbol used to separate the integer and fractional parts of a number.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum DecimalSymbol
```
```vb
Public Enumeration DecimalSymbol
```
```cpp
public enum class DecimalSymbol
```
```fsharp
type DecimalSymbol
```

| Member name | Value | Description |
| --- | --- | --- |
| Comma | 1 | A comma (","). |
| Dot | 0 | A dot ("."). |

#### Reference

Autodesk.Revit.DB Namespace